cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream RetjOS(Printed);
  InstPrinter->printInst(&Retj, /*Address=*/0, /*Annot=*/"", *STI, RetjOS);
  RetjOS.flush();
  EXPECT_EQ(Printed, "\tretj");

  Printed.clear();
  raw_string_ostream RetsOS(Printed);
  InstPrinter->printInst(&Rets, /*Address=*/0, /*Annot=*/"", *STI, RetsOS);
  RetsOS.flush();
  EXPECT_EQ(Printed, "\trets");

  Printed.clear();
  raw_string_ostream RetssOS(Printed);
  InstPrinter->printInst(&Retss, /*Address=*/0, /*Annot=*/"", *STI, RetssOS);
  RetssOS.flush();
  EXPECT_EQ(Printed, "\tretss");

  Printed.clear();
  raw_string_ostream RolOS(Printed);
  InstPrinter->printInst(&Rol, /*Address=*/0, /*Annot=*/"", *STI, RolOS);
  RolOS.flush();
  EXPECT_EQ(Printed, "\trol\tr1");

  Printed.clear();
  raw_string_ostream RorOS(Printed);
  InstPrinter->printInst(&Ror, /*Address=*/0, /*Annot=*/"", *STI, RorOS);
  RorOS.flush();
  EXPECT_EQ(Printed, "\tror\tr1");

  Printed.clear();
  raw_string_ostream RsubOS(Printed);
  InstPrinter->printInst(&Rsub, /*Address=*/0, /*Annot=*/"", *STI, RsubOS);
  RsubOS.flush();
  EXPECT_EQ(Printed, "\trsub\tr1, r2");

  Printed.clear();
  raw_string_ostream RsubEqOS(Printed);
  InstPrinter->printInst(&RsubEq, /*Address=*/0, /*Annot=*/"", *STI,
                         RsubEqOS);
  RsubEqOS.flush();
  EXPECT_EQ(Printed, "\trsubeq\tr1, -1");

  Printed.clear();
  raw_string_ostream RsubAlOS(Printed);
  InstPrinter->printInst(&RsubAl, /*Address=*/0, /*Annot=*/"", *STI,
                         RsubAlOS);
  RsubAlOS.flush();
  EXPECT_EQ(Printed, "\trsubal\tr1, -1");

  Printed.clear();
  raw_string_ostream SataddWOS(Printed);
  InstPrinter->printInst(&SataddW, /*Address=*/0, /*Annot=*/"", *STI,
                         SataddWOS);
  SataddWOS.flush();
  EXPECT_EQ(Printed, "\tsatadd.w\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SatsubHOS(Printed);
  InstPrinter->printInst(&SatsubH, /*Address=*/0, /*Annot=*/"", *STI,
                         SatsubHOS);
  SatsubHOS.flush();
  EXPECT_EQ(Printed, "\tsatsub.h\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SatsubWOS(Printed);
  InstPrinter->printInst(&SatsubW, /*Address=*/0, /*Annot=*/"", *STI,
                         SatsubWOS);
  SatsubWOS.flush();
  EXPECT_EQ(Printed, "\tsatsub.w\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SatsubWImmOS(Printed);
  InstPrinter->printInst(&SatsubWImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SatsubWImmOS);
  SatsubWImmOS.flush();
  EXPECT_EQ(Printed, "\tsatsub.w\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream SatrndsOS(Printed);
  InstPrinter->printInst(&Satrnds, /*Address=*/0, /*Annot=*/"", *STI,
                         SatrndsOS);
  SatrndsOS.flush();
  EXPECT_EQ(Printed, "\tsatrnds\tr1 >> 2, 3");

  Printed.clear();
  raw_string_ostream SatrnduOS(Printed);
  InstPrinter->printInst(&Satrndu, /*Address=*/0, /*Annot=*/"", *STI,
                         SatrnduOS);
  SatrnduOS.flush();
  EXPECT_EQ(Printed, "\tsatrndu\tr1 >> 2, 3");

  Printed.clear();
  raw_string_ostream SatsOS(Printed);
  InstPrinter->printInst(&Sats, /*Address=*/0, /*Annot=*/"", *STI, SatsOS);
  SatsOS.flush();
  EXPECT_EQ(Printed, "\tsats\tr1 >> 2, 3");

  Printed.clear();
  raw_string_ostream SatuOS(Printed);
  InstPrinter->printInst(&Satu, /*Address=*/0, /*Annot=*/"", *STI, SatuOS);
  SatuOS.flush();
  EXPECT_EQ(Printed, "\tsatu\tr1 >> 2, 3");

  Printed.clear();
  raw_string_ostream SbcOS(Printed);
  InstPrinter->printInst(&Sbc, /*Address=*/0, /*Annot=*/"", *STI, SbcOS);
  SbcOS.flush();
  EXPECT_EQ(Printed, "\tsbc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SbrOS(Printed);
  InstPrinter->printInst(&Sbr, /*Address=*/0, /*Annot=*/"", *STI, SbrOS);
  SbrOS.flush();
  EXPECT_EQ(Printed, "\tsbr\tr1, 1");

  Printed.clear();
  raw_string_ostream StBPostIncOS(Printed);
  InstPrinter->printInst(&StBPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StBPostIncOS);
  StBPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1++, r2");

  Printed.clear();
  raw_string_ostream StBPreDecOS(Printed);
  InstPrinter->printInst(&StBPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StBPreDecOS);
  StBPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.b\t--r1, r2");

  Printed.clear();
  raw_string_ostream StBDisp3OS(Printed);
  InstPrinter->printInst(&StBDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         StBDisp3OS);
  StBDisp3OS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1[3], r2");

  Printed.clear();
  raw_string_ostream StBDisp16OS(Printed);
  InstPrinter->printInst(&StBDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StBDisp16OS);
  StBDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StBIndexShiftOS(Printed);
  InstPrinter->printInst(&StBIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StBIndexShiftOS);
  StBIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.b\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StBEqDisp9OS(Printed);
  InstPrinter->printInst(&StBEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StBEqDisp9OS);
  StBEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.beq\tr1[3], r2");

  Printed.clear();
  raw_string_ostream StBAlDisp9OS(Printed);
  InstPrinter->printInst(&StBAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StBAlDisp9OS);
  StBAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.bal\tr1[3], r2");

  Printed.clear();
  raw_string_ostream ScallOS(Printed);
  InstPrinter->printInst(&Scall, /*Address=*/0, /*Annot=*/"", *STI, ScallOS);
  ScallOS.flush();
  EXPECT_EQ(Printed, "\tscall");

  Printed.clear();
  raw_string_ostream SscallOS(Printed);
  InstPrinter->printInst(&Sscall, /*Address=*/0, /*Annot=*/"", *STI,
                         SscallOS);
  SscallOS.flush();
  EXPECT_EQ(Printed, "\tsscall");

  Printed.clear();
  raw_string_ostream ScrOS(Printed);
  InstPrinter->printInst(&Scr, /*Address=*/0, /*Annot=*/"", *STI, ScrOS);
  ScrOS.flush();
  EXPECT_EQ(Printed, "\tscr\tr1");

